#pragma once
#include <DirectXMath.h>
#include <Windows.h>

namespace MCB
{
    //頂点データ構造体-------------------------------------
    typedef struct StructVertex
    {
        DirectX::XMFLOAT3 pos;//xyz座標
        DirectX::XMFLOAT3 normal;//法線ベクトル
        DirectX::XMFLOAT2 uv;//uv座標
    };
    //--------------------------------------
    class Vertex
    {
    public:
        StructVertex Box[24] =
        {
            //前
            {{-5.0f,-5.0f,-5.0f} ,{} ,{0.0f,1.0f}},// 左下(x,y,z,u,v)
            {{-5.0f,5.0f,-5.0f}  ,{} ,{0.0f,0.0f}},// 左上
            {{5.0f,-5.0f,-5.0f}  ,{} ,{1.0f,1.0f}},// 右下
            {{5.0f,5.0f,-5.0f}   ,{} ,{1.0f,0.0f}},// 右上
            //後ろ
            {{-5.0f,5.0f,5.0f}  ,{} ,{0.0f,0.0f}},// 左上
            {{-5.0f,-5.0f,5.0f} ,{} ,{0.0f,1.0f}},// 左下(x,y,z,u,v)
            {{5.0f,5.0f,5.0f}   ,{} ,{1.0f,0.0f}},// 右上
            {{5.0f,-5.0f,5.0f}  ,{} ,{1.0f,1.0f}},// 右下
            //左
            {{-5.0f,-5.0f,-5.0f} ,{} ,{0.0f,1.0f}},// 左下(x,y,z,u,v)
            {{-5.0f,-5.0f,5.0f}  ,{} ,{0.0f,0.0f}},// 左上
            {{-5.0f,5.0f,-5.0f}  ,{} ,{1.0f,1.0f}},// 右下
            {{-5.0f,5.0f,5.0f}   ,{} ,{1.0f,0.0f}},// 右上
            //右
            {{5.0f,-5.0f,5.0f}  ,{} ,{0.0f,0.0f}},// 左上
            {{5.0f,-5.0f,-5.0f} ,{} ,{0.0f,1.0f}},// 左下(x,y,z,u,v)
            {{5.0f,5.0f,5.0f}   ,{} ,{1.0f,0.0f}},// 右上
            {{5.0f,5.0f,-5.0f}  ,{} ,{1.0f,1.0f}},// 右下
            //上
            {{-5.0f,-5.0f,-5.0f} ,{} ,{0.0f,1.0f}},// 左下(x,y,z,u,v)
            {{5.0f,-5.0f,-5.0f}  ,{} ,{0.0f,0.0f}},// 左上
            {{-5.0f,-5.0f,5.0f}  ,{} ,{1.0f,1.0f}},// 右下
            {{5.0f,-5.0f,5.0f}   ,{} ,{1.0f,0.0f}},// 右上
            //下
            {{5.0f,5.0f,-5.0f}  ,{} ,{0.0f,0.0f}},// 左上
            {{-5.0f,5.0f,-5.0f} ,{} ,{0.0f,1.0f}},// 左下(x,y,z,u,v)
            {{5.0f,5.0f,5.0f}   ,{} ,{1.0f,0.0f}},// 右上
            {{-5.0f,5.0f,5.0f}  ,{} ,{1.0f,1.0f}},// 右下
        };

        unsigned short boxIndices[36]
        {
            //前
            0,1,2,
            2,1,3,
            //後ろ
            4,5,6,
            6,5,7,
            //左
            8,9,10,
            10,9,11,
            //右
            12,13,14,
            14,13,15,
            //上
            16,17,18,
            18,17,19,
            //下
            20,21,22,
            22,21,23,
        };
    
         UINT sizeVB = static_cast<UINT>(sizeof(Box[0]) * _countof(Box));

         //インデックスデータ全体のサイズ
         UINT sizeIB = static_cast<UINT>(sizeof(uint16_t) * _countof(boxIndices));
    };

}

